# SquareMillimeters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..SquareMillimeters Property
UnitTypeId Class See Also
---
Square millimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SquareMillimeters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SquareMillimeters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SquareMillimeters {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace